app/Livewire/Tenants/LabTechnician/CreateLabTestDefinition.php

insert into "lab_test_definitions" ("test_name", "description", "price", "units", "tenant_id", "updated_at", "created_at") values ('fips:tbce5XGqQNkjppAZ2fuWtrS0O5PHhS6GVtKz-wQNMSo1W10wdhXpFleScUid4akKrLr6oRfjWe4XxxGYYelPjyPAqYhjEeQ0ObVpjmxtf2qLlv8BanRgcqvc-n4ZACDrsAQVapbSPhzZdwrp', 'fips:5f9BgKxNDy9RfFMDyMY_L5W6P6dh4-1JhHLDX3kUryBmiI95WCQdsqv18BjHcmNRAIKjCz6PTb6rvUiSmdTSjtZABLsGzqDIKzRt-OMmUFJZTw4BFMWLnqpE2tz5h21limvdywEntdPFPYlPfqQ=', 9000, 'mg', '2ebc45a9-cabc-429e-970b-a88d333353a2', '2025-12-16 16:27:47', '2025-12-16 16:27:47')
---
    public function saveTest(LabService $labService)
    {
        // Validate all properties using the #[Rule] attributes
        $validatedData = $this->validate();

        try {
            // Delegate logic to the service
            $labService->createTestDefinition([
                'test_name' => $this->test_name,
                'description' => $this->description,
                'price' => $this->price,
                'units' => $this->units,
            ]);