app/Livewire/Tenants/LabTechnician/Index.php

    public function loadDashboardData()
    {
        $today = Carbon::today();

        $this->pendingLabRequests = LabRequest::query()
            ->where('status', 'Pending')
            ->with(['patient', 'testDefinition', 'doctor'])
            ->orderBy('request_date', 'desc') // Added ordering for display
            ->get();

        $this->completedTestsToday = LabResult::query()
            ->whereDate('result_date', $today)
            ->with(['labRequest.patient', 'labRequest.testDefinition'])
            ->get();
---
select * from "lab_requests" where "status" = 'Pending' and "lab_requests"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2' order by "request_date" desc
select * from "lab_results" where strftime('%Y-%m-%d', "result_date") = cast('2025-12-16' as text) and "lab_results"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'