app/Livewire/Tenants/LabTechnician/LabResult.php

select count(*) as aggregate from "lab_results" where "lab_results"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'
---
    public function render()
    {
        $query = ModelsLabResult::query()->with(['labRequest.patient', 'labRequest.testDefinition', 'doctor']);
        // dd($query);
        // Apply search filter
        if ($this->search) {
            $terms = explode(' ', $this->search);

            $query->when($this->search, function ($q) use ($terms) {
                $q->whereHas('labRequest.patient', function ($patientQuery) use ($terms) {
                    if (count($terms) === 2) {
                        dd($terms);
                        // Exact first + last name search (most efficient)
                        $patientQuery->whereBlind('first_name', 'first_name_index', $terms[0])
                            ->whereBlind('last_name', 'last_name_index', $terms[1]);
                    } else {
                        // Single term or multiple fragments: match against indexed fields
                        foreach ($terms as $term) {
                            $patientQuery->whereBlind('first_name', 'first_name_index', $term)
                                ->orWhereBlind('last_name', 'last_name_index', $term)
                                ->orWhere('patient_uid', 'ILIKE', "%{$this->search}%");
                        }
                    }
                });