app/Livewire/Tenants/LabTechnician/ManageLabTestDefinitions.php

    public function render()
    {
        $query = LabTestDefinition::query();

         if ($this->search) {
           $terms = explode(' ',$this->search);

            $query->where(function ($q) use ($terms) {

                // Search by test name (still indexed with blind search)
                foreach ($terms as $term) {
                     $q->orWhereBlind('test_name', 'test_name_index', $term);
                }
            });
        }

        $labTests = $query->orderBy('test_name')->paginate(10);
---
select * from "lab_test_definitions" where "lab_test_definitions"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2' order by "test_name" asc limit 10 offset 0
select count(*) as aggregate from "lab_test_definitions" where "lab_test_definitions"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'