app/Livewire/Tenants/LabTechnician/TestRequest.php

select count(*) as aggregate from "lab_requests" where "lab_requests"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'
---
    public function render(LabService $labService)
    {
        // Define filters for the service
        $filters = [
            'search' => $this->search,
            'status' => $this->statusFilter,
        ];

        // Fetch query from service and apply pagination
        $requests = $labService->getLabRequestsQuery($filters)->paginate(10);