app/Livewire/Tenants/Doctor/DoctorAppointment.php

    public function datesWithAppointments(): array
    {
        $doctorId = Auth::id();

        // Look back 7 days and forward 14 days to cover scrolling range
        $startDate = now()->subDays(7)->startOfDay();
        $endDate = now()->addDays(14)->endOfDay();

        return Appointment::query()
            ->where('doctor_id', $doctorId)
            ->whereBetween('appointment_date', [$startDate, $endDate])
            ->whereIn('status', ['Scheduled', 'In Consultation', 'Pending']) // Optional: Filter active only
            ->distinct()
            ->pluck('appointment_date')
            ->map(fn($date) => Carbon::parse($date)->format('Y-m-d'))
            ->toArray();
---
select distinct "appointment_date" from "appointments" where "doctor_id" = 4 and "appointment_date" between '2025-12-09 00:00:00' and '2025-12-30 23:59:59' and "status" in ('Scheduled', 'In Consultation', 'Pending') and "appointments"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'

    public function processedAppointments(): array
    {
        $this->validateOnly('selectedDate');

        $doctorId = Auth::id();

        $appointments = Appointment::query()
            ->where('doctor_id', $doctorId)
            ->whereDate('appointment_date', $this->selectedDate)
            ->with('patient') // Eager load patient
            ->orderBy('appointment_time')
            ->orderBy('queue_position')
            ->get();
---
select * from "appointments" where "doctor_id" = 4 and strftime('%Y-%m-%d', "appointment_date") = cast('2025-12-16' as text) and "appointments"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2' order by "appointment_time" asc, "queue_position" asc