app/Livewire/Tenants/Doctor/Index.php

select * from "appointments" where "doctor_id" = 4 and "appointment_date" >= '2025-12-17 00:00:00' and "appointments"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2' order by "appointment_date" asc, "appointment_time" asc
---
    public function loadAppointments()
    {
        $doctorId = Auth::id(); // Get the currently authenticated doctor's ID
        $today = Carbon::today();

        $this->upcomingAppointments = Appointment::where('doctor_id', $doctorId)
            ->where('appointment_date', '>=', $today)
            ->with('patient') // Eager load patient relationship
            ->orderBy('appointment_date')
            ->orderBy('appointment_time')
            ->get();

select distinct * from "patients" where exists (select * from "admissions" where "patients"."id" = "admissions"."patient_id" and "doctor_id" = 4 and "admissions"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2') and "patients"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'
---
    public function loadPatientsUnderCare()
    {
        $doctorId = Auth::id(); // Get the currently authenticated doctor's ID

        // Fetch patients who have had appointments or medical records with this doctor
        $this->patientsUnderCare = Patient::whereHas('admissions', function ($query) use ($doctorId) {
            $query->where('doctor_id', $doctorId);
        })
            ->distinct()
            ->get();

select * from "lab_results" where "doctor_id" = 4 and "result_date" >= '2025-12-17 00:00:00' and "lab_results"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2' order by "result_date" desc limit 5
---
    public function loadIncomingLabResults()
    {
        $doctorId = Auth::id(); // Get the currently authenticated doctor's ID
        $today = Carbon::today();
        $this->incomingLabResults = LabResult::where('doctor_id', Auth::id())
            ->with(['labRequest.patient', 'labRequest.testDefinition']) // Eager load relationships
            ->where('result_date', '>=', $today)
            ->orderBy('result_date', 'desc')
            ->limit(5) // Correct way to limit the result set
            ->get();