app/Livewire/Tenants/Doctor/MedicalRecord.php

    public function mount(): void
    {
        $this->patientResults = collect();

        // Optimized queries for dropdowns
        $this->allMedications = Medication::select('id', 'name', 'stock_quantity')->orderBy('name')->get();
        $this->allLabTests = LabTestDefinition::select('id', 'test_name', 'code')->orderBy('test_name')->get();
        $this->labTechnicianOptions = User::where('role', 'lab-technician')->select('id', 'name')->orderBy('name')->get();
---
select "id", "name", "stock_quantity" from "medications" where "medications"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2' order by "name" asc
select "id", "test_name", "code" from "lab_test_definitions" where "lab_test_definitions"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2' order by "test_name" asc
select "id", "name" from "users" where "role" = 'lab-technician' and "users"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2' order by "name" asc

    public function updatedSelectedPatientId(): void
    {
        if (! $this->selectedPatientId) {
            $this->resetContext();
            return;
        }

        $this->patient = Patient::find($this->selectedPatientId);

        if (! $this->patient) {
            $this->resetContext();
            return;
        }

        // Check for existing Draft
        $this->medicalRecord = MedicalRecordModel::with(['attachments'])
            ->where('patient_id', $this->selectedPatientId)
            ->where('doctor_id', Auth::id())
            ->where('finalized', false)
            ->first();
---
select * from "patients" where "patients"."id" = 1 and "patients"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2' limit 1
select * from "medical_records" where "patient_id" = 1 and "doctor_id" = 4 and "finalized" = 0 and "medical_records"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2' limit 1

    public function removeStoredAttachment(int $id): void
    {
        $att = MedicalRecordAttachment::where('id', $id)->first();
---
select * from "medical_record_attachments" where "medical_record_attachments"."medical_record_id" = 8 and "medical_record_attachments"."medical_record_id" is not null and "medical_record_attachments"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'

    public function saveAll(bool $finalize = false): void
    {
        $this->validate();
        if (!$this->selectedPatientId) return;

        try {
            // We use DB transaction to ensure data integrity
            DB::transaction(function () use ($finalize) {

                // 1. SAVE MEDICAL RECORD
                $data = [
                    'patient_id' => $this->selectedPatientId,
                    'doctor_id' => Auth::id(),
                    'complaint' => $this->complaint,
                    'diagnosis_text' => $this->diagnosisText,
                    'general_notes' => $this->clinicalNotes,
                    'finalized' => $finalize,
                    'record_type' => 'consultation',
                ];

                if ($this->medicalRecord) {
                    $this->medicalRecord->update($data);
                    $record = $this->medicalRecord;
                } else {
                    $record = MedicalRecordModel::create($data);
---
update "medical_records" set "finalized" = 1, "updated_at" = '2025-12-16 23:02:54' where "id" = 8
insert into "medical_records" ("patient_id", "doctor_id", "complaint", "diagnosis_text", "general_notes", "finalized", "record_type", "tenant_id", "updated_at", "created_at") values (1, 4, 'jkklkl', null, 'lkllklkl', 0, 'consultation', '2ebc45a9-cabc-429e-970b-a88d333353a2', '2025-12-16 21:16:06', '2025-12-16 21:16:06')

                $prescriptionEventToFire = null;

                if (count($this->prescriptionItems) > 0) {
                    $prescription = Prescription::firstOrCreate(
                        ['consultation_id' => $record->id],
                        [
                            'patient_id' => $this->selectedPatientId,
                            'doctor_id' => Auth::id(),
                            'prescription_date' => now(),
                            'status' => $finalize ? 'prescribed' : 'draft',
                        ]
                    );

                    if ($finalize) {
                        $prescription->update(['status' => 'prescribed']);
                        $prescriptionEventToFire = $prescription; // Prepare event data
                    }

                    $prescription->items()->delete(); // Sync strategy
---
insert into "prescriptions" ("consultation_id", "patient_id", "doctor_id", "prescription_date", "status", "tenant_id", "updated_at", "created_at") values (8, 1, 4, '2025-12-16 21:16:06', 'draft', '2ebc45a9-cabc-429e-970b-a88d333353a2', '2025-12-16 21:16:06', '2025-12-16 21:16:06')
select * from "prescriptions" where ("consultation_id" = 8) and "prescriptions"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2' limit 1
update "prescriptions" set "status" = 'prescribed', "updated_at" = '2025-12-16 23:02:54' where "id" = 7
delete from "prescription_items" where "prescription_items"."prescription_id" = 7 and "prescription_items"."prescription_id" is not null and "prescription_items"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'

                            'quantity_prescribed' => 1, 'created_at' => now(), 'updated_at' => now(),
                        ];
                    }
                    if (!empty($prescItemsData)) PrescriptionItem::insert($prescItemsData);

                } else {
                    // Empty list -> delete draft prescription
                    Prescription::where('consultation_id', $record->id)->where('status', 'draft')->delete();
---
insert into "prescription_items" ("created_at", "dosage", "duration", "frequency", "medication_id", "prescription_id", "quantity_prescribed", "tenant_id", "updated_at") values ('2025-12-16 22:48:26', '', '', '', 1, 7, 1, '2ebc45a9-cabc-429e-970b-a88d333353a2', '2025-12-16 22:48:26'), ('2025-12-16 22:48:26', '', '', '', 2, 7, 1, '2ebc45a9-cabc-429e-970b-a88d333353a2', '2025-12-16 22:48:26')
delete from "prescriptions" where "consultation_id" = 8 and "status" = 'draft' and "prescriptions"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'

                $labOrdersCreated = false;

                foreach ($this->labItems as $lab) {
                    $labReq = LabRequest::updateOrCreate(
                        ['consultation_id' => $record->id, 'lab_test_definition_id' => $lab['lab_test_definition_id']],
                        [
                            'patient_id' => $this->selectedPatientId,
                             'tenant_id' => $prescription->tenant_id,
                            'requested_by_doctor_id' => Auth::id(),
                            'urgency_level' => $lab['urgency'],
                            // 'lab_tech_id' => $lab['lab_tech_id'], // Optional: specific assignment
                            'reason_for_test' => $lab['reason'],
                            'request_date' => now(),
                        ]
                    );

                    if ($labReq->wasRecentlyCreated) {
                        $labReq->status = 'requested';
                        $labReq->save();
---
insert into "lab_requests" ("consultation_id", "lab_test_definition_id", "patient_id", "requested_by_doctor_id", "urgency_level", "reason_for_test", "request_date", "tenant_id", "updated_at", "created_at") values (8, 2, 1, 4, 'normal', '', '2025-12-16 22:48:26', '2ebc45a9-cabc-429e-970b-a88d333353a2', '2025-12-16 22:48:26', '2025-12-16 22:48:26')
select * from "lab_requests" where ("consultation_id" = 8 and "lab_test_definition_id" = 1) and "lab_requests"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2' limit 1
update "lab_requests" set "status" = 'requested', "updated_at" = '2025-12-16 22:48:26' where "id" = 2

    protected function loadDraftPrescriptions()
    {
        if (!$this->medicalRecord) return;
        $prescription = Prescription::with('items.medication')->where('consultation_id', $this->medicalRecord->id)->first();
---
select * from "medications" where "medications"."id" in (1, 2) and "medications"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'
select * from "prescriptions" where "consultation_id" = 8 and "prescriptions"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2' limit 1

    protected function loadDraftLabs()
    {
        if (!$this->medicalRecord) return;
        $labs = LabRequest::with('testDefinition')->where('consultation_id', $this->medicalRecord->id)->get();
---
select * from "lab_requests" where "consultation_id" = 8 and "lab_requests"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'
select * from "lab_test_definitions" where "lab_test_definitions"."id" in (1, 2) and "lab_test_definitions"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'