app/Livewire/Tenants/Doctor/Patient.php

            )
            // Eager-load relationships to avoid N+1 queries
            ->with(['appointments', 'admissions'])
            // Paginate results (15 per page)
            ->paginate(15);
---
select * from "admissions" where "admissions"."patient_id" in (1) and "admissions"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'
select * from "appointments" where "appointments"."patient_id" in (1) and "appointments"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'