app/Traits/UserActivitiesTrait.php

    public function logActivity(string $type, string $description, array $properties = [])
    {
        UserActivity::create([
            'user_id' => Auth::id(),          // the receptionist
            'activity_type' => $type,
            'description' => $description,
            'properties' => $properties,
        ]);
---
insert into "user_activities" ("user_id", "activity_type", "description", "properties", "tenant_id", "updated_at", "created_at") values (7, 'lab_test_updated', 'fips:ZBLGhRzG1-2Yosq9W5kvrJ7681570wvEBLhsmT1MwJtDAo01HHUs1k3_UdNQRdUX7qon3L58lczGGZic3JwMsMSVga6k9i7rIniCjZNo44G0Xl5syyf18athnUmNRuc5kUDTGrxGZq2UCQq_pVQ9zSJppDqw_P9IZT5nv4c_IKLMJdgCzNFg3Q==', '{"lab_tech_id":7,"lab_test_id":1}', '2ebc45a9-cabc-429e-970b-a88d333353a2', '2025-12-16 16:27:47', '2025-12-16 16:27:47')