app/Livewire/Tenants/Receptionist/Index.php

select count(*) as aggregate from "patients" where "patients"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'
select * from "appointments" where strftime('%Y-%m-%d', "appointment_date") = cast('2025-12-16' as text) and "appointments"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'
select count(*) as aggregate from "appointments" where strftime('%Y-%m-%d', "appointment_date") = cast('2025-12-16' as text) and "status" = 'Waiting' and "appointments"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'
select count(*) as aggregate from "appointments" where strftime('%Y-%m-%d', "appointment_date") = cast('2025-12-16' as text) and "status" = 'Confirmed' and "appointments"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'
select * from "invoices" where "status" in ('unpaid', 'partial') and "invoices"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2' order by "created_at" desc limit 10
---
    public function loadDashboardData()
    {
        $today = Carbon::today();

        // Count total patients
        $this->totalPatientsRegistered = Patient::count();

        // Get today's appointments with related patient and doctor
        $this->appointmentsToday = Appointment::whereDate('appointment_date', $today)
            ->with(['patient', 'doctor'])
            ->get();
        // Get today's appointments with related patient and doctor
        $this->appointmentsTodayPending = Appointment::whereDate('appointment_date', $today)->where('status', 'Waiting')->count();
        $this->appointmentsTodayConfirmed = Appointment::whereDate('appointment_date', $today)->where('status', 'Confirmed')->count();
        $this->pendingPaymentsList = Invoice::whereIn('status', ['unpaid', 'partial'])
            ->with('patient')
            ->orderByDesc('created_at')
            ->limit(10)
            ->get();

select "id", "first_name", "last_name" from "patients" where "patients"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2' order by "first_name" asc
select "id", "name" from "users" where "role" = 'doctor' and "users"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2' order by "name" asc
---
    public function loadPatientsAndDoctors()
    {
        // Only select necessary columns for efficiency
        $this->patients = Patient::select('id', 'first_name', 'last_name')->orderBy('first_name')->get();
        $this->doctors = User::select('id', 'name')->where('role', 'doctor')->orderBy('name')->get();