app/Livewire/Tenants/Admin/AdminFeedbackHistory.php

    public function render(): View
    {
        $query = FeedBack::query()

            // Order by creation date descending (most recent first)
            ->orderBy('created_at', 'desc');

        $query->where('user_id',Auth::id());

        $feedbacks = $query->paginate(10);
---
select count(*) as aggregate from "feed_backs" where "user_id" = 2 and "feed_backs"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'