app/Livewire/Tenants/Admin/CreateNewUser.php

select "id", "name" from "departments" where "tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2' and "departments"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'
---
    public function mount()
    {
        // Load departments specific to this tenant
        $this->departments = Department::where('tenant_id', tenant('id'))->get(['id', 'name']);

insert into "users" ("name", "email", "phone_number", "address", "gender", "profile_picture", "department_id", "hire_date", "role", "is_active", "password", "tenant_id", "updated_at", "created_at") values ('Bliss Jane', 'bliss@gmail.com', '+2376524149036', null, 'Female', null, null, null, 'lab-technician', 1, '$2y$12$mfzqSN2B5PU4huz.ye86zOh08qk0DBIZc3V6Jacrgv9wZ3kh2MnfS', '2ebc45a9-cabc-429e-970b-a88d333353a2', '2025-12-16 16:15:42', '2025-12-16 16:15:42')
---
   public function saveUser()
    {
        $this->validate();

        $storedPath = null;



        try {
            // 1. Upload File FIRST (If it fails, transaction hasn't even hit DB yet)
            if ($this->profile_picture) {
                $storedPath = $this->profile_picture->store('profile_pictures', 's3');
            }

            // 2. Create User
            $user = User::create([
                'name' => $this->name,
                'email' => $this->email,
                'phone_number' => $this->phone_number,
                'address' => $this->address,
                'gender' => $this->gender,
                'profile_picture' => $storedPath,
                'department_id' => $this->department_id,
                'hire_date' => $this->hire_date,
                'role' => $this->role,
                'is_active' => $this->is_active,
                'password' => Hash::make(Str::random(32)),
                'tenant_id' => tenant('id'), // Ensure tenant_id is explicitly set if not global
            ]);