app/Livewire/Tenants/Admin/Index.php

    public function loadDashboardData()
    {
        // 1. Metrics
        $today = Carbon::today();

        // Revenue: Sum of Appointment Prices (Completed) + Admission Observation Fees
        // Assuming 'price' and 'observation_fee' are numeric
        $apptRevenue = Appointment::whereDate('appointment_date', $today)
            ->where('status', 'Completed')
            ->sum('price');

        $admissionRevenue = Admission::whereDate('created_at', $today)
            ->sum('observation_fee');

        $this->dailyTotalRevenue = $apptRevenue + $admissionRevenue;

        $this->totalPatientsAdmittedToday = Admission::whereDate('created_at', $today)->count();
        $this->totalAppointmentsToday = Appointment::whereDate('appointment_date', $today)->count();

        // Bed Stats
        $this->totalBeds = Bed::count();
        $this->totalBedsOccupied = Bed::where('is_occupied', true)->count();

        // Supply Stats (Low Stock)
        $this->lowStockCount = Supply::whereColumn('current_stock', '<=', 'min_stock_level')->count();
---
select sum("price") as aggregate from "appointments" where strftime('%Y-%m-%d', "appointment_date") = cast('2025-12-16' as text) and "status" = 'Completed' and "appointments"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'
select sum("observation_fee") as aggregate from "admissions" where strftime('%Y-%m-%d', "created_at") = cast('2025-12-16' as text) and "admissions"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'
select count(*) as aggregate from "admissions" where strftime('%Y-%m-%d', "created_at") = cast('2025-12-16' as text) and "admissions"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'
select count(*) as aggregate from "beds" where "beds"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'
select count(*) as aggregate from "beds" where "is_occupied" = 1 and "beds"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'
select count(*) as aggregate from "supplies" where "current_stock" <= "min_stock_level" and "supplies"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'

        for ($i = 5; $i >= 0; $i--) {
            $date = Carbon::now()->subMonths($i);
            $labels[] = $date->format('M');
            $data[] = Appointment::whereMonth('appointment_date', $date->month)
                                 ->whereYear('appointment_date', $date->year)
                                 ->count();
---
select count(*) as aggregate from "appointments" where strftime('%Y-%m-%d', "appointment_date") = cast('2025-12-16' as text) and "appointments"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'

        // 3. Encounter Summary (This Week)
        $this->totalDoctors = User::where('role', 'doctor')->count(); // Ensure 'role' matches your DB string exactly (e.g. 'Doctor' vs 'doctor')
        $this->totalSystemUsers = User::count();
        $this->totalDepartments = Department::count();
---
select count(*) as aggregate from "departments" where "departments"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'

        $startOfWeek = Carbon::now()->startOfWeek();
        for ($i = 0; $i < 7; $i++) {
            $day = $startOfWeek->copy()->addDays($i);
            $this->encounterSummaryLabels[] = $day->format('D'); // Mon, Tue...
            $this->encounterSummaryData[] = Appointment::whereDate('appointment_date', $day)->count();
---
select count(*) as aggregate from "appointments" where strftime('%m', "appointment_date") = cast('07' as text) and strftime('%Y', "appointment_date") = cast(2025 as text) and "appointments"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'

        // 4. Role Summary
        $roles = ['doctor', 'nurse', 'pharmacist', 'admin', 'receptionist','lab-technician'];
        foreach ($roles as $role) {
            $usersInRole = User::where('role', $role)->get();
            $count = $usersInRole->count();
---
select * from "users" where "role" = 'doctor' and "users"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'
select count(*) as aggregate from "users" where "users"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'

        }

        // 5. Recent Admissions (Eager load patient to avoid N+1)
        $this->recentAdmissions = Admission::with(['patient', 'bed.ward'])
            ->latest()
            ->take(5)
            ->get();
---
select * from "admissions" where "admissions"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2' order by "created_at" desc limit 5