app/Livewire/Tenants/Admin/RevenueDashboard.php

    public function calculatePreviousPeriodRevenue(): void
    {
        [$start, $end] = $this->getPreviousDateRange();

        /** @var object|null $totals */
        $totals = RevenueSummary::whereBetween('transaction_date', [$start, $end])
            ->select(
                DB::raw('COALESCE(SUM(medication_revenue), 0) as total_medication'),
                DB::raw('COALESCE(SUM(appointment_revenue), 0) as total_appointment'),
                DB::raw('COALESCE(SUM(lab_revenue), 0) as total_lab'),
                DB::raw('COALESCE(SUM(admission_revenue), 0) as total_admission'),
                DB::raw('COALESCE(SUM(bed_fee_revenue), 0) as total_bed_fee')
            )->first();
---
select COALESCE(SUM(medication_revenue), 0) as total_medication, COALESCE(SUM(appointment_revenue), 0) as total_appointment, COALESCE(SUM(lab_revenue), 0) as total_lab, COALESCE(SUM(admission_revenue), 0) as total_admission, COALESCE(SUM(bed_fee_revenue), 0) as total_bed_fee from "revenue_summaries" where "transaction_date" between '2025-12-01 00:00:00' and '2025-12-31 23:59:59' and "revenue_summaries"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2' limit 1

    public function render()
    {
        [$start, $end] = $this->getDateRange();

        // NOTE: We do NOT use a join here because your Patient model uses encryption.
        // A SQL Join would retrieve encrypted ciphertext for the name.
        // Instead, we group by patient_id and eager load the 'patient' relationship.
        // This allows Laravel/CipherSweet to decrypt the name when you access $row->patient->name in the view.

        $patientRevenues = RevenueSummary::query()
            ->whereBetween('transaction_date', [$start, $end])
            ->select(
                'patient_id',
                DB::raw('SUM(medication_revenue) as medications'),
                DB::raw('SUM(appointment_revenue) as appointments'),
                DB::raw('SUM(lab_revenue) as labs'),
                DB::raw('SUM(admission_revenue) as admissions'),
                DB::raw('SUM(bed_fee_revenue) as bed_fees'),
                DB::raw('SUM(medication_revenue + appointment_revenue + lab_revenue + admission_revenue + bed_fee_revenue) as total')
            )
            ->groupBy('patient_id')
            ->orderByDesc('total')
            ->with('patient') // This triggers the decryption in the model
            ->paginate(10);
---
select "patient_id", SUM(medication_revenue) as medications, SUM(appointment_revenue) as appointments, SUM(lab_revenue) as labs, SUM(admission_revenue) as admissions, SUM(bed_fee_revenue) as bed_fees, (SUM(medication_revenue) + SUM(appointment_revenue) + SUM(lab_revenue) + SUM(admission_revenue) + SUM(bed_fee_revenue)) as total from "revenue_summaries" where "transaction_date" between '2025-12-01 00:00:00' and '2025-12-31 23:59:59' and "revenue_summaries"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2' group by "patient_id" order by "total" desc limit 10 offset 0
select * from "patients" where "patients"."id" in (1) and "patients"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'