app/Livewire/Tenants/Admin/Settings.php

select * from "subscriptions" where "subscriptions"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2' limit 1
---
    public function mount()
    {
        $this->tenant = tenant();
        $this->hospitalName = $this->tenant->name ?? '';
        $this->hospitalAddress = $this->tenant->address ?? '';
        $this->hospitalEmail = $this->tenant->contact_email ?? '';


        $this->currentLogoUrl = $this->tenant?->logo
            ? Storage::disk('s3')->temporaryUrl($this->tenant->logo, now()->addMinutes(5))
            : null;

        // Fetch Subscription safely
        $this->subscription = Subscription::first();

select * from "departments" where "departments"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'
select * from "subscriptions" where "subscriptions"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'
select * from "wards" where "wards"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'
select * from "bed_types" where "bed_types"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'
select * from "beds" where "beds"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'
select * from "supplies" where "supplies"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'
---
    public function render()
    {
        return view('livewire.tenants.admin.settings', [
            'filteredDepartments' => Department::when($this->searchDepartment, fn ($q) => $q->where('name', 'like', '%'.$this->searchDepartment.'%'))->get(),
            'subscriptions' => Subscription::all(),

            'filteredWards' => Ward::with('department')
                ->when($this->searchWard, fn ($q) => $q->where('name', 'like', '%'.$this->searchWard.'%'))
                ->get(),

            'filteredBedTypes' => BedType::when($this->searchBedType, fn ($q) => $q->where('name', 'like', '%'.$this->searchBedType.'%'))->get(),

            'filteredBeds' => Bed::with(['ward.department', 'bedType'])
                ->when($this->searchBed, fn ($q) => $q->where('bed_number', 'like', '%'.$this->searchBed.'%'))
                ->get(),

            'filteredSupplies' => Supply::when($this->searchSupply, fn ($q) => $q->where('name', 'like', '%'.$this->searchSupply.'%'))->get(),
        ]);