app/Livewire/Tenants/Admin/UserManagement.php

select "user_shifts".*, "user_user_shift"."user_id" as "pivot_user_id", "user_user_shift"."user_shift_id" as "pivot_user_shift_id" from "user_shifts" inner join "user_user_shift" on "user_shifts"."id" = "user_user_shift"."user_shift_id" where "user_user_shift"."user_id" in (3, 4, 5, 6, 7) and "user_shifts"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'
select * from "users" where "role" != 'admin' and "users"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2' order by "name" asc limit 10 offset 0
select count(*) as aggregate from "users" where "role" != 'admin' and "users"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'
---
    public function users()
    {
        return User::with('shifts')
            ->where('role', '!=', 'admin')
            ->when($this->search, fn ($q) => $q->where(fn ($sq) => $sq->where('name', 'LIKE', "%{$this->search}%")->orWhere('email', 'LIKE', "%{$this->search}%")))
            ->when($this->filterRole, fn ($q) => $q->where('role', $this->filterRole))
            ->when($this->filterStatus !== '', fn ($q) => $q->where('is_active', $this->filterStatus === 'active'))
            ->orderBy('name')
            ->paginate(10);

select * from "user_shifts" where "shift_date" >= '2025-12-16' and "user_shifts"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2' order by "shift_date" asc, "start_time" asc
---
    public function availableShifts()
    {
        return UserShift::where('shift_date', '>=', now()->toDateString())
            ->orderBy('shift_date')
            ->orderBy('start_time')
            ->get();