app/Livewire/Tenants/Admin/UserActivities.php

    public function mount(): void
    {
        // Get all unique, non-null activity types, sort them, and convert to an array.
        $this->activityTypes = UserActivity::query()
            ->select('activity_type')
            ->whereNotNull('activity_type')
            ->distinct()
            ->orderBy('activity_type')
            ->pluck('activity_type')
            ->toArray();
---
select distinct "activity_type" from "user_activities" where "activity_type" is not null and "user_activities"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2' order by "activity_type" asc


        // Fetch all users for the 'Filter by User' dropdown
        /** @var \Illuminate\Database\Eloquent\Collection<\App\Models\User> $users */
        $users = User::query()
            ->orderBy('name')
            ->get(['id', 'name']);
---
select "id", "name" from "users" where "users"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2' order by "name" asc