app/Livewire/Tenants/Pharmacist/Dashboard.php

select count(*) as aggregate from "prescriptions" where "status" = 'prescribed' and exists (select * from "prescription_items" where "prescriptions"."id" = "prescription_items"."prescription_id" and "quantity_prescribed" > "dispensed_quantity" and "prescription_items"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2') and "prescriptions"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'
select sum("stock_quantity") as aggregate from "medications" where "medications"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'
---
    public function loadDashboardData(): void
    {
        $today = Carbon::today();

        // 1. Prescriptions dispensed today
        // Count prescriptions that have at least one item dispensed today.
        // This now correctly uses the nested relationship from Prescription -> PrescriptionItem -> Dispensation.
        $this->prescriptionsDispensedToday = Prescription::whereHas('items.dispensations', function ($query) use ($today) {
            $query->whereDate('created_at', $today);
        })->count();

        // 2. Prescriptions pending (not fully dispensed)
        $this->prescriptionsPending = Prescription::where('status', 'Pending')
            ->whereHas('items', function ($query) {
                $query->whereColumn('quantity_prescribed', '>', 'dispensed_quantity');
            })->count();

        // 3. Drugs left in inventory
        // Sum the stock_quantity of all medications.
        $this->drugsLeftInInventory = Medication::sum('stock_quantity');

select * from "medications" where "medications"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2' order by "name" asc limit 10 offset 0
select count(*) as aggregate from "medications" where "medications"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'
---
    public function getMedicationsProperty(): LengthAwarePaginator
    {
        $query = Medication::query();

        if ($this->search) {
            $query->where('name', 'ILIKE', "%{$this->search}%");
        }

        $query->orderBy($this->sortBy, $this->sortDirection);

        return $query->paginate(10);