app/Livewire/Tenants/Pharmacist/FeedBackRequestList.php

select * from "feed_backs" where "user_id" = 5 and "feed_backs"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2' limit 10 offset 0
select count(*) as aggregate from "feed_backs" where "user_id" = 5 and "feed_backs"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'
---
    public function render(): \Illuminate\View\View
    {
        $query = FeedBack::query();
        $query->where('user_id', Auth::id());

        $feedbacks = $query->paginate(10);