app/Livewire/Tenants/Pharmacist/ManageDrugsInventory.php

select * from "medications" where "medications"."id" = 1 and "medications"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2' limit 1
---
    public function viewEditDrug(int $drugId)
    {
        $drug = Medication::findOrFail($drugId);

select * from "medications" where "medications"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2' limit 10 offset 0
select count(*) as aggregate from "medications" where "medications"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'
---
    public function render()
    {
        $query = Medication::query();

        // Apply search filter
        if ($this->search) {
            $query->whereBlind('name', 'name_index', $this->search);
        }

        // Apply status filter for low stock
        if ($this->statusFilter === 'low-stock') {
            $query->whereColumn('stock_quantity', '<=', 'min_stock_level');
        } elseif ($this->statusFilter === 'in-stock') {
            $query->whereColumn('stock_quantity', '>', 'min_stock_level');
        }

        $drugs = $query->paginate(10); // Paginate with 10 items per page