app/Livewire/Tenants/Pharmacist/Medications.php

select * from "patients" where "patients"."id" = 1 and "patients"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2' limit 1
---
    public function selectPatient(int $patientId): void
    {
        $this->resetPrescriptionSelection();
        $this->selectedPatientId = $patientId;
        $this->selectedPatient = Patient::find($patientId);

select * from "prescriptions" where "prescriptions"."patient_id" = 1 and "prescriptions"."patient_id" is not null and "prescriptions"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2' order by "prescription_date" desc
---
    public function loadPatientPrescriptions(): void
    {
        if (! $this->selectedPatient) {
            $this->patientPrescriptions = [];

            return;
        }
        $this->patientPrescriptions = $this->selectedPatient
            ->prescriptions()
            ->latest('prescription_date')
            ->with('doctor')
            ->get();

select * from "patients" where "patients"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2' order by "created_at" desc limit 10 offset 0
select count(*) as aggregate from "patients" where "patients"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'
---
    public function render()
    {
        $query = Patient::query();

        if ($this->search) {
            $terms = explode(' ', $this->search);

            $query->where(function ($q) use ($terms) {
                if (count($terms) === 2) {
                    // Exact first + last name search (most efficient)
                    $q->whereBlind('first_name', 'first_name_index', $terms[0])
                        ->whereBlind('last_name', 'last_name_index', $terms[1]);
                } else {
                    // Single term or multiple fragments: match against indexed fields
                    foreach ($terms as $term) {
                        $q->orWhereBlind('first_name', 'first_name_index', $term)
                            ->orWhereBlind('last_name', 'last_name_index', $term)
                            ->orWhere('patient_uid', 'ILIKE', "%{$term}%");
                    }
                }
            });
        }

        $patients = $query->latest()->paginate(10);