app/Livewire/Tenants/Nurse/Dashboard.php

    public function render()
    {

        /* KPIs */
        // These KPIs are already correctly counting 'Admitted' from the Admission model.
        $admitted = Admission::where('status', 'Admitted')->count();
        $vitalsDue = Supply::all()->count();
        $lowStock = Supply::whereColumn('current_stock', '<=', 'min_stock_level')->count();
        $runningIVs = SupplyUsage::whereHas('supply', fn ($q) => $q->where('name', 'like', '%IV%'))
            ->whereDate('usage_date', now()->toDateString())
            ->count();

        /*
         * Main change: Fetch Admitted Patients for the Bed Map table
         * This will list currently admitted patients, ordered by their admission date (latest first).
         */
        $admittedPatients = Admission::where('status', 'Admitted')
            ->with(['patient', 'bed.ward']) // Eager load patient and bed's ward
            ->orderByDesc('admission_date') // Assuming an 'admission_date' column. If not, use 'created_at'.
            ->get();

        /* Low-stock items */
        $lowStockItems = Supply::whereColumn('current_stock', '<=', 'min_stock_level')
            ->get(['name', 'current_stock']);
---
select count(*) as aggregate from "admissions" where "status" = 'Admitted' and "admissions"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'
select count(*) as aggregate from "supplies" where "current_stock" <= "min_stock_level" and "supplies"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'
select count(*) as aggregate from "supply_usages" where exists (select * from "supplies" where "supply_usages"."supply_id" = "supplies"."id" and "name" like '%IV%' and "supplies"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2') and strftime('%Y-%m-%d', "usage_date") = cast('2025-12-16' as text) and "supply_usages"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'
select * from "admissions" where "status" = 'Admitted' and "admissions"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2' order by "admission_date" desc
select "name", "current_stock" from "supplies" where "current_stock" <= "min_stock_level" and "supplies"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2'