app/Livewire/Tenants/Nurse/RecordVitals.php

    public function mount()
    {
        // Fetch all patients for the dropdown as before
        $this->patients = Patient::orderBy('first_name')->orderBy('last_name')->get();
---
select * from "patients" where "patients"."tenant_id" = '2ebc45a9-cabc-429e-970b-a88d333353a2' order by "first_name" asc, "last_name" asc